backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_1
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 48
      - 48
      - 1
      dtype: float32
      name: input_1
      ragged: false
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 8
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.009999999776482582
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: conv2d
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d
        - 0
        - 0
        - {}
    name: batch_normalization
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation
      trainable: true
    inbound_nodes:
    - - - batch_normalization
        - 0
        - 0
        - {}
    name: activation
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 8
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.009999999776482582
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_1
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation
        - 0
        - 0
        - {}
    name: conv2d_1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: batch_normalization_1
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_1
      trainable: true
    inbound_nodes:
    - - - batch_normalization_1
        - 0
        - 0
        - {}
    name: activation_1
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      depthwise_regularizer: null
      dilation_rate: &id002 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.009999999776482582
      kernel_size: !!python/tuple
      - 3
      - 3
      name: separable_conv2d
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      pointwise_regularizer: null
      strides: &id003 !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - {}
    name: separable_conv2d
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_3
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv2d
        - 0
        - 0
        - {}
    name: batch_normalization_3
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_2
      trainable: true
    inbound_nodes:
    - - - batch_normalization_3
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      depthwise_regularizer: null
      dilation_rate: *id002
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.009999999776482582
      kernel_size: !!python/tuple
      - 3
      - 3
      name: separable_conv2d_1
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      pointwise_regularizer: null
      strides: *id003
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: separable_conv2d_1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_4
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv2d_1
        - 0
        - 0
        - {}
    name: batch_normalization_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_2
      padding: same
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - {}
    name: conv2d_2
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d
      padding: same
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - batch_normalization_4
        - 0
        - 0
        - {}
    name: max_pooling2d
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_2
        - 0
        - 0
        - {}
    name: batch_normalization_2
  - class_name: Add
    config:
      dtype: float32
      name: add
      trainable: true
    inbound_nodes:
    - - - max_pooling2d
        - 0
        - 0
        - &id004 {}
      - - batch_normalization_2
        - 0
        - 0
        - *id004
    name: add
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      depthwise_regularizer: null
      dilation_rate: *id002
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.009999999776482582
      kernel_size: !!python/tuple
      - 3
      - 3
      name: separable_conv2d_2
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      pointwise_regularizer: null
      strides: *id003
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - add
        - 0
        - 0
        - {}
    name: separable_conv2d_2
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_6
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv2d_2
        - 0
        - 0
        - {}
    name: batch_normalization_6
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_3
      trainable: true
    inbound_nodes:
    - - - batch_normalization_6
        - 0
        - 0
        - {}
    name: activation_3
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      depthwise_regularizer: null
      dilation_rate: *id002
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.009999999776482582
      kernel_size: !!python/tuple
      - 3
      - 3
      name: separable_conv2d_3
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      pointwise_regularizer: null
      strides: *id003
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_3
        - 0
        - 0
        - {}
    name: separable_conv2d_3
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_7
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv2d_3
        - 0
        - 0
        - {}
    name: batch_normalization_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_3
      padding: same
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - add
        - 0
        - 0
        - {}
    name: conv2d_3
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_1
      padding: same
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - batch_normalization_7
        - 0
        - 0
        - {}
    name: max_pooling2d_1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_5
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_3
        - 0
        - 0
        - {}
    name: batch_normalization_5
  - class_name: Add
    config:
      dtype: float32
      name: add_1
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_1
        - 0
        - 0
        - &id005 {}
      - - batch_normalization_5
        - 0
        - 0
        - *id005
    name: add_1
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      depthwise_regularizer: null
      dilation_rate: *id002
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.009999999776482582
      kernel_size: !!python/tuple
      - 3
      - 3
      name: separable_conv2d_4
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      pointwise_regularizer: null
      strides: *id003
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: separable_conv2d_4
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_9
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv2d_4
        - 0
        - 0
        - {}
    name: batch_normalization_9
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_4
      trainable: true
    inbound_nodes:
    - - - batch_normalization_9
        - 0
        - 0
        - {}
    name: activation_4
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      depthwise_regularizer: null
      dilation_rate: *id002
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.009999999776482582
      kernel_size: !!python/tuple
      - 3
      - 3
      name: separable_conv2d_5
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      pointwise_regularizer: null
      strides: *id003
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_4
        - 0
        - 0
        - {}
    name: separable_conv2d_5
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_10
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv2d_5
        - 0
        - 0
        - {}
    name: batch_normalization_10
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_4
      padding: same
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: conv2d_4
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_2
      padding: same
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - batch_normalization_10
        - 0
        - 0
        - {}
    name: max_pooling2d_2
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_8
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_4
        - 0
        - 0
        - {}
    name: batch_normalization_8
  - class_name: Add
    config:
      dtype: float32
      name: add_2
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - &id006 {}
      - - batch_normalization_8
        - 0
        - 0
        - *id006
    name: add_2
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      depthwise_regularizer: null
      dilation_rate: *id002
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.009999999776482582
      kernel_size: !!python/tuple
      - 3
      - 3
      name: separable_conv2d_6
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      pointwise_regularizer: null
      strides: *id003
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - add_2
        - 0
        - 0
        - {}
    name: separable_conv2d_6
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_12
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv2d_6
        - 0
        - 0
        - {}
    name: batch_normalization_12
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_5
      trainable: true
    inbound_nodes:
    - - - batch_normalization_12
        - 0
        - 0
        - {}
    name: activation_5
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      depthwise_regularizer: null
      dilation_rate: *id002
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.009999999776482582
      kernel_size: !!python/tuple
      - 3
      - 3
      name: separable_conv2d_7
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      pointwise_regularizer: null
      strides: *id003
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_5
        - 0
        - 0
        - {}
    name: separable_conv2d_7
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_13
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv2d_7
        - 0
        - 0
        - {}
    name: batch_normalization_13
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_5
      padding: same
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - add_2
        - 0
        - 0
        - {}
    name: conv2d_5
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_3
      padding: same
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - batch_normalization_13
        - 0
        - 0
        - {}
    name: max_pooling2d_3
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_11
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_5
        - 0
        - 0
        - {}
    name: batch_normalization_11
  - class_name: Add
    config:
      dtype: float32
      name: add_3
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_3
        - 0
        - 0
        - &id007 {}
      - - batch_normalization_11
        - 0
        - 0
        - *id007
    name: add_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 3
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_6
      padding: same
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_3
        - 0
        - 0
        - {}
    name: conv2d_6
  - class_name: GlobalAveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: global_average_pooling2d
      trainable: true
    inbound_nodes:
    - - - conv2d_6
        - 0
        - 0
        - {}
    name: global_average_pooling2d
  - class_name: Activation
    config:
      activation: softmax
      dtype: float32
      name: predictions
      trainable: true
    inbound_nodes:
    - - - global_average_pooling2d
        - 0
        - 0
        - {}
    name: predictions
  name: model
  output_layers:
  - - predictions
    - 0
    - 0
keras_version: 2.2.4-tf
